{
  "backend/main.mo": "Main Motoko actor defining the campus marketplace backend with types for buy/sell, rental, and lost-found items, user profiles, access control, blob storage, and CRUD endpoints gated by university email validation.",
  "backend/migration.mo": "Stub migration module that accepts the current actor state and returns it unchanged, serving as a no-op migration placeholder.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (frontend pages, auth, theming, profile dropdown) to their source files, component dependencies, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing the purpose and recent changes of every component, page, hook, and utility in the React app.",
  "frontend/index.css": "Empty CSS file with no content.",
  "frontend/index.html": "HTML entry point that sets the page title to 'UniXange - University Exchange Platform' and mounts the React app via a root div and module script.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes, wraps the app in ThemeProvider and QueryClientProvider, and sets up a QueryClient with smart retry logic that avoids retrying stopped-canister errors.",
  "frontend/src/components/AddItemModal.tsx": "Dialog modal for posting new marketplace items across buy/sell, rent, and lost-found sections, supporting image upload with blob storage fallback for large files and an AI description generator that uses title, category, and condition as context.",
  "frontend/src/components/AISmartSearch.tsx": "Controlled search input component with a Sparkles icon and a submit button that triggers an onSearch callback after a short simulated delay, with a clear button to reset the query.",
  "frontend/src/components/AuthResolutionErrorScreen.tsx": "Displays a full-page error screen for authentication failures with three variants (timeout, access-denied, error), showing contextual icons, messages, and retry/logout actions. Includes special handling for stopped/unavailable canister errors.",
  "frontend/src/components/DeleteConfirmationModal.tsx": "A reusable alert dialog modal that prompts the user to confirm deletion of an item, with configurable title, description, loading state, and confirm/cancel actions.",
  "frontend/src/components/FloatingAddButton.tsx": "A fixed-position circular floating action button with a plus icon, used to trigger adding a new listing.",
  "frontend/src/components/Footer.tsx": "Site footer with brand description, quick navigation links (Buy, Sell, Rent, Lost & Found), and about links (About, Contact, Privacy, Terms), plus a copyright line and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, desktop navigation links, auth controls (login/signup or profile avatar menu), and a responsive mobile hamburger menu.",
  "frontend/src/components/ItemCard.tsx": "A card component for displaying marketplace listings with image, title, price, condition, category, status badge, and action buttons for WhatsApp contact and deletion. Navigates to the item detail page on click.",
  "frontend/src/components/LoginModal.tsx": "A dialog modal handling login and signup flows via Internet Identity, cycling through views for choice, loading, access-denied, and error states.",
  "frontend/src/components/ProfileAvatarMenu.tsx": "A dropdown avatar menu showing the authenticated user's name, email, and university, with a logout action that clears identity and React Query cache.",
  "frontend/src/components/ProfileSetup.tsx": "A wrapper component that gates app access behind profile creation and onboarding steps for authenticated Internet Identity users, rendering multi-step forms for name/email and year/address details before showing children.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useActorInitGuard.ts": "An enhanced actor initialization hook that wraps actor creation with a 20-second timeout, exposes explicit status states (initializing/ready/error/timeout), and provides an in-app retry mechanism without page reload.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, persisting identity across reloads and exposing login/clear functions with status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including user profiles, onboarding answers, and marketplace items (buy/sell, rental, lost-and-found), each using the actor from useActor.",
  "frontend/src/index.css": "Global stylesheet that configures Tailwind CSS with an OLX-inspired beige/black marketplace color palette using CSS custom properties, including light and dark mode variants and custom utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/About.tsx": "A static informational page describing UniXange's mission, features, and value proposition for Jain University students.",
  "frontend/src/pages/BuySection.tsx": "Displays a paginated grid of buy-only marketplace items with AI smart search, skeleton loading states, and authenticated users can post or delete items via modals.",
  "frontend/src/pages/Contact.tsx": "Static contact page showing email addresses for support, feedback, and help, along with a note about response times.",
  "frontend/src/pages/Homepage.tsx": "Landing page featuring a hero section with AI search, category navigation cards, and recent buy/sell and rental listings with search filtering.",
  "frontend/src/pages/ItemDetail.tsx": "Detail view for a single marketplace item (buy/sell, rental, or lost-found) with an image gallery, item metadata, WhatsApp contact button, and AI-powered recommendations.",
  "frontend/src/pages/LostFoundSection.tsx": "Lost & Found page with tabbed Lost/Found views, skeleton loading, item grid, and authenticated users can report lost or found items and delete their own entries.",
  "frontend/src/pages/Privacy.tsx": "Static privacy policy page covering data collection, usage, sharing, security, retention, and user rights for the UniXange platform.",
  "frontend/src/pages/RentSection.tsx": "Page component displaying all rental listings with AI smart search, skeleton loading states, and options for authenticated users to add or delete items.",
  "frontend/src/pages/SellSection.tsx": "Page component showing only the current authenticated user's buy/sell listings, with options to add new listings or delete existing ones.",
  "frontend/src/pages/Terms.tsx": "Static Terms of Service page for UniXange, covering eligibility, user responsibilities, prohibited activities, and liability limitations.",
  "frontend/src/utils/actorInitErrors.ts": "Defines typed error primitives and type guards for distinguishing actor initialization timeout errors from other errors.",
  "frontend/src/utils/adminEmailAllowlist.ts": "Exports a hardcoded set of admin emails and a helper function to check if a given email belongs to an admin.",
  "frontend/src/utils/aiDescriptionGenerator.ts": "Generates templated item descriptions based on title, category, condition, keywords, and listing type using predefined phrase maps.",
  "frontend/src/utils/aiRecommender.ts": "Scores and returns similar item recommendations based on category match, price proximity, and keyword overlap relative to a target item.",
  "frontend/src/utils/aiSmartSearch.ts": "Parses natural-language search queries into structured filters (price range, condition, category, keywords) and applies them to filter and rank buy/sell and rental items.",
  "frontend/src/utils/authIntent.ts": "Manages a sessionStorage-backed auth intent flag ('login' or 'signup') with set, get, and clear helpers.",
  "frontend/src/utils/icRejectionErrors.ts": "Provides utilities to detect and parse IC-specific rejection errors, including identifying stopped-canister errors (IC0508) and extracting canister IDs from error messages.",
  "frontend/src/utils/promiseTimeout.ts": "Wraps a promise with a hard timeout, rejecting with a standardized timeout error if the operation exceeds the specified duration.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Converts raw initialization and IC errors into user-friendly messages, handling stopped canister, timeout, auth, network, and generic canister error cases.",
  "frontend/src/utils/universityEmail.ts": "Validates that an email belongs to @jainuniversity.ac.in or the admin allowlist, and returns appropriate error messages for invalid emails.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters from both query strings and hash-based routing, with sessionStorage persistence and hash cleanup helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the app's custom color tokens (beige/marketplace theme), border radii, fonts, accordion animations, and required plugins.",
  "project_state.json": "Tracks the current state of the UniXange project including version, architectural notes, known issues (stopped backend canister), and implemented/requested features."
}