{
  "backend/main.mo": "Main Motoko actor defining the campus marketplace backend with types for buy/sell, rental, lost & found items, user profiles, and onboarding; includes access control, blob storage mixins, and helper functions for email validation and item ID generation.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (dark mode Tailwind config, ThemeProvider, and dark mode variants across all components) to their associated files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted text file containing one-sentence summaries of each frontend source file, serving as a reference document for the project's frontend architecture and component responsibilities.",
  "frontend/index.css": "Empty CSS file at the frontend root level with no content.",
  "frontend/index.html": "HTML entry point for the UniXange university exchange platform, loading the React app via /src/main.tsx with appropriate meta tags and a root div.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for all pages (Home, Buy, Rent, Sell, Lost & Found, About, Contact, Terms, Privacy), wraps the app in QueryClientProvider, and includes a ThemeProvider that syncs the 'dark' class on the document root with the user's system color scheme preference.",
  "frontend/src/components/AddItemModal.tsx": "Modal dialog for posting items across buy/sell, rental, lost, and found sections; handles image uploads (routing large files to blob storage), form state, and delegates to the appropriate React Query mutation based on the active section.",
  "frontend/src/components/AuthResolutionErrorScreen.tsx": "Full-screen error display component for authentication failures, rendering timeout, access-denied, or generic error variants with contextual icons, messages, and retry/logout action buttons.",
  "frontend/src/components/DeleteConfirmationModal.tsx": "A modal dialog component that prompts the user to confirm deletion of an item by name, with Cancel and Delete action buttons.",
  "frontend/src/components/FloatingAddButton.tsx": "A fixed floating action button in the bottom-right corner with a plus icon, used to trigger adding a new item.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, quick navigation links, and about/legal links, plus a copyright bar at the bottom.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, desktop search bar, navigation links for Buy/Sell/Rent/Lost & Found, and login/profile controls with a mobile hamburger menu.",
  "frontend/src/components/ItemCard.tsx": "A card component that displays details for buy/sell, rental, or lost-and-found items, including image, price/status badges, and owner-only delete functionality.",
  "frontend/src/components/LoginModal.tsx": "A dialog modal offering Login and Sign Up actions via Internet Identity, with loading states and links to terms/privacy policy.",
  "frontend/src/components/ProfileAvatarMenu.tsx": "A dropdown avatar menu showing the authenticated user's profile info (name, email, university) and a logout option.",
  "frontend/src/components/ProfileSetup.tsx": "A modal dialog component that prompts newly authenticated users to complete their profile (name, Jain University email, university) before using the marketplace, with actor initialization error/timeout handling.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches a backend actor instance (anonymous or authenticated), initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useActorInitGuard.ts": "An enhanced actor initialization hook that wraps actor creation with a 20-second timeout, exposes explicit status states (initializing/ready/error/timeout), and provides an in-app retry mechanism.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend data fetching and mutations (user profiles, onboarding answers, marketplace items), wrapping actor calls with timeouts and sanitized error handling.",
  "frontend/src/index.css": "Global stylesheet that defines Tailwind CSS base/component/utility layers, CSS custom properties for light and dark marketplace themes (colors, tokens, shadows), and imports the Inter font.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/About.tsx": "Renders the About page for UniXange with sections covering the mission, key features (verified users, community, pricing, categories), service offerings (buy/sell, rent, lost & found, security), and a call-to-action to join.",
  "frontend/src/pages/BuySection.tsx": "Displays a searchable, filterable, and sortable grid of buy/sell items fetched via React Query, with category filter buttons and sort options (newest, price ascending/descending).",
  "frontend/src/pages/Contact.tsx": "Renders a static Contact page with three contact cards (general inquiries, feedback, support) each showing an email link, plus a brief campus community note.",
  "frontend/src/pages/Homepage.tsx": "Renders the main landing page with a hero section, quick-action navigation buttons (Buy, Sell, Rent, Lost & Found), a category grid, and a features section highlighting campus verification, community, and deals.",
  "frontend/src/pages/LostFoundSection.tsx": "Displays lost and found items with tab filtering (all/lost/found/recovered), supports reporting new items via a choice dialog and modal, and handles authentication gating with a login prompt.",
  "frontend/src/pages/Privacy.tsx": "Renders a static Privacy Policy page covering data collection, usage, sharing, security, retention, and user rights for the UniXange platform.",
  "frontend/src/pages/RentSection.tsx": "Page component for browsing and listing rental items, showing auth prompts, loading/error states, and a grid of ItemCards with an add-item modal gated behind authentication and profile checks.",
  "frontend/src/pages/SellSection.tsx": "Page component for managing a user's own buy/sell listings, filtering items by seller principal, with auth-gated add-item and login modals.",
  "frontend/src/pages/Terms.tsx": "Static Terms of Service page rendering eight numbered sections (acceptance, eligibility, responsibilities, etc.) for the UniXange platform.",
  "frontend/src/utils/actorInitErrors.ts": "Defines a typed timeout error marker, a type guard, and a factory function for creating actor-initialization timeout errors.",
  "frontend/src/utils/adminEmailAllowlist.ts": "Maintains a hardcoded set of non-university admin emails and exports helpers to check membership and list all allowlisted addresses.",
  "frontend/src/utils/authIntent.ts": "Persists and retrieves a 'login' or 'signup' intent string in sessionStorage to survive the Internet Identity redirect flow.",
  "frontend/src/utils/icRejectionErrors.ts": "Utilities for detecting IC-specific rejection errors (stopped canister, IC0508), extracting canister IDs from error messages, and identifying any IC rejection.",
  "frontend/src/utils/promiseTimeout.ts": "Wraps any promise with a hard timeout, rejecting with a typed timeout error if the operation exceeds the specified millisecond limit.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Converts raw errors into user-friendly strings by checking for stopped-canister, timeout, auth, network, and other known error patterns before falling back to a generic message.",
  "frontend/src/utils/universityEmail.ts": "Validates that an email belongs to the @jainuniversity.ac.in domain or the admin allowlist, and returns a descriptive error message for invalid inputs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, custom CSS variable-driven color tokens, typography/animate plugins, and accordion keyframe animations.",
  "project_state.json": "Project state manifest (version 3) tracking existing features and a pending feature request to add system-preference-based dark/light mode theme switching."
}