{
  "backend/main.mo": "Motoko backend defining item, user, and profile types, managing item IDs, user profiles, access control, and helper utilities for email validation and campus membership checks.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs for audit and tracking.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend files across the project.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "HTML entry point defining root container and loading the main TypeScript application module.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps all pages with ThemeProvider, layout, header, footer, and profile gate.",
  "frontend/src/components/AddItemModal.tsx": "Modal component for creating marketplace items with image handling, validation, and categorized error display.",
  "frontend/src/components/AuthResolutionErrorScreen.tsx": "UI screen showing timeout, access-denied, or generic errors during auth resolution with retry and logout controls.",
  "frontend/src/components/DeleteConfirmationModal.tsx": "Alert dialog prompting users to confirm item deletion with optional loading state.",
  "frontend/src/components/FloatingAddButton.tsx": "Renders a floating circular add button with a plus icon that triggers an onClick handler.",
  "frontend/src/components/Footer.tsx": "Displays the site footer with branding, quick links, an about section, and a copyright notice.",
  "frontend/src/components/Header.tsx": "Implements the responsive site header with navigation, search, auth handling, and profile menu integration.",
  "frontend/src/components/ItemCard.tsx": "Shows an item preview card with image, pricing, details, badges, and optional contact or delete actions.",
  "frontend/src/components/LoginModal.tsx": "Provides a modal for login or signup using Internet Identity with loading states and intent handling.",
  "frontend/src/components/ProfileAvatarMenu.tsx": "Displays a user avatar dropdown with profile info and a logout option using Internet Identity.",
  "frontend/src/components/ProfileSetup.tsx": "Manages user onboarding and profile creation steps, validating email and storing onboarding answers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes related queries when the identity changes.",
  "frontend/src/hooks/useActorInitGuard.ts": "Initializes the backend actor with timeout/error handling and exposes status and retry controls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identities, and client initialization.",
  "frontend/src/hooks/useQueries.ts": "Defines data-fetching and mutation hooks for user profiles, onboarding, and other backend interactions using the guarded actor.",
  "frontend/src/index.css": "Configures Tailwind CSS theme variables, dark mode styles, typography, and custom marketplace utilities.",
  "frontend/src/main.tsx": "Bootstraps the app with React, providing query and Internet Identity providers.",
  "frontend/src/pages/About.tsx": "Renders the About page describing UniXange’s mission, features, and purpose.",
  "frontend/src/pages/BuySection.tsx": "Displays items for sale with filtering, handles deletion, network errors, and owner checks.",
  "frontend/src/pages/Contact.tsx": "Static contact page showing support, feedback, and help information with icons.",
  "frontend/src/pages/Homepage.tsx": "Homepage showing hero section, category shortcuts, and previews of recent buy and rental items.",
  "frontend/src/pages/LostFoundSection.tsx": "Manages lost and found items with tabs, item creation, deletion, authentication, and profile validation.",
  "frontend/src/pages/Privacy.tsx": "Static privacy policy page outlining data collection, usage, sharing, security, and user rights.",
  "frontend/src/pages/RentSection.tsx": "Displays rental items, supports adding and deleting listings with authentication and profile checks, and handles network errors.",
  "frontend/src/pages/SellSection.tsx": "Component showing the user’s sell listings with add/delete item workflows, authentication checks, and network/profile error handling.",
  "frontend/src/pages/Terms.tsx": "Static Terms of Service page outlining rules, eligibility, responsibilities, and liability.",
  "frontend/src/utils/actorInitErrors.ts": "Defines timeout error markers and helpers for identifying and creating actor initialization timeout errors.",
  "frontend/src/utils/adminEmailAllowlist.ts": "Provides an admin email allowlist and utilities to check or retrieve allowlisted admin emails.",
  "frontend/src/utils/authIntent.ts": "Stores, retrieves, and clears a user’s login/signup intent in sessionStorage for auth flows.",
  "frontend/src/utils/icRejectionErrors.ts": "Utilities to detect and parse IC rejection errors, including stopped-canister cases and canister ID extraction.",
  "frontend/src/utils/promiseTimeout.ts": "Wraps a promise with a timeout and returns a consistent timeout error on expiration.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Converts raw errors into user‑friendly messages, handling IC, timeout, auth, and network cases.",
  "frontend/src/utils/universityEmail.ts": "Validates university or allowlisted admin emails and returns corresponding error messages.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters across routing and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, defining content paths, and extending theme with custom colors, radii, fonts, animations, and plugins.",
  "project_state.json": "Project state describing known IC initialization issues, stopped-canister errors, and feature requirements for error handling and actor creation fixes."
}