{
  "backend/main.mo": "Defines item, user, and lost‑found data models, access control, email validation, and state maps for a marketplace canister.",
  "feature_evidence.json": "Lists features, affected files, components, and test IDs for footer rebuild and integration validation.",
  "frontend-file-summaries.txt": "Provides short build-planning summaries for major frontend files and components.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "HTML entry point loading the React app root and main module.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and global layout with Header, Footer, and ProfileSetup.",
  "frontend/src/components/AddItemModal.tsx": "Modal for creating items with image uploads, validation, and detailed error categorization.",
  "frontend/src/components/AuthResolutionErrorScreen.tsx": "Displays timeout, access‑denied, or general error states during profile/auth resolution.",
  "frontend/src/components/DeleteConfirmationModal.tsx": "Alert dialog for confirming item deletion with cancel and delete actions.",
  "frontend/src/components/FloatingAddButton.tsx": "Floating circular action button used to trigger item creation flows.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, quick links, an about section, and a dynamic copyright year.",
  "frontend/src/components/Header.tsx": "Implements the main header with navigation, search, authentication controls, and mobile menu behavior.",
  "frontend/src/components/ItemCard.tsx": "Displays an item with image, price, details, and optional contact or delete actions.",
  "frontend/src/components/LoginModal.tsx": "Provides a modal for login or signup using Internet Identity with loading states.",
  "frontend/src/components/ProfileAvatarMenu.tsx": "Shows a user avatar dropdown with profile info and a logout option.",
  "frontend/src/components/ProfileSetup.tsx": "Handles onboarding flow for creating a user profile and answering initial questions with validation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and identity state handling.",
  "frontend/src/hooks/useQueries.ts": "Defines data-fetching and mutation hooks using React Query, adding error categorization, retry logic, and backend actor integration.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles, theme variables, dark mode tokens, and custom utility classes for the UI.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/About.tsx": "Static About page describing UniXange’s mission and features for university students.",
  "frontend/src/pages/BuySection.tsx": "Page for browsing and filtering marketplace items, including item deletion, network error handling, and ownership checks.",
  "frontend/src/pages/Contact.tsx": "Static Contact page listing support, feedback, and help information for UniXange users.",
  "frontend/src/pages/Homepage.tsx": "Renders the homepage with hero content, category navigation buttons, and previews of recent buy and rental items. Uses data-fetching hooks and navigation to marketplace sections.",
  "frontend/src/pages/LostFoundSection.tsx": "Displays lost and found items with tabs, supports adding and deleting items, and enforces authentication and profile checks. Handles modals for posting, deleting, and login.",
  "frontend/src/pages/Privacy.tsx": "Static privacy policy page outlining data collection, usage, retention, rights, and security. Contains structured sections with headings and text content.",
  "frontend/src/pages/RentSection.tsx": "Shows rental items and allows authenticated users with valid profiles to list new rentals and delete their items. Handles network errors, modals, and loading states.",
  "frontend/src/pages/SellSection.tsx": "Lists items posted for sale by the authenticated user, with functionality to add and delete listings. Implements profile checks, error handling, and modal workflows.",
  "frontend/src/pages/Terms.tsx": "React page rendering the Terms of Service with sections covering eligibility, user responsibilities, prohibited activities, and liability.",
  "frontend/src/utils/adminEmailAllowlist.ts": "Defines an allowlist of admin emails and provides helpers to check and retrieve them.",
  "frontend/src/utils/authIntent.ts": "Manages storing, retrieving, and clearing the user's login/signup intent in sessionStorage.",
  "frontend/src/utils/promiseTimeout.ts": "Provides a helper to wrap a promise with a timeout that rejects after a specified duration.",
  "frontend/src/utils/universityEmail.ts": "Validates university emails or allowlisted admin emails and returns related error messages.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and layout settings.",
  "project_state.json": "Tracks project state, known issues, and feature requests related to rebuilding the app footer."
}