{
  "backend/main.mo": "Motoko canister implementing a campus marketplace backend with buy/sell, rental, and lost & found items, user profiles, blob storage, and role-based authorization enforcing university email membership.",
  "feature_evidence.json": "Feature evidence report documenting frontend fixes to authentication/profile setup flows, gating logic, and React Query behavior to avoid loading dead-ends during login and onboarding.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of frontend files describing routing, components, hooks, styling, and recent fixes to profile gating and authentication flows.",
  "frontend/index.css": "Global stylesheet entry point for the frontend; content not shown here but referenced for marketplace-wide styles.",
  "frontend/index.html": "HTML entry point defining metadata, page title, root mount node, and loading the React application.",
  "frontend/src/App.tsx": "Main React application setup using TanStack Router, a shared layout with Header/Footer, ProfileSetup gate, theme provider, and route definitions for marketplace sections.",
  "frontend/src/components/AddItemModal.tsx": "Modal form for adding buy/sell, rent, or lost/found items with image uploads, validation, categorized error handling, and submission via backend blobs.",
  "frontend/src/components/DeleteConfirmationModal.tsx": "Reusable confirmation dialog prompting users to confirm item deletion with loading and disabled states.",
  "frontend/src/components/FloatingAddButton.tsx": "Floating circular action button styled for the marketplace, triggering item creation flows.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright information with minimal marketplace styling.",
  "frontend/src/components/Header.tsx": "Implements the main sticky site header with logo navigation, search bar, authentication actions, and responsive mobile menu. Handles Internet Identity login/signup/logout, auth intent tracking, scroll-based styling, and query cache clearing on logout.",
  "frontend/src/components/ItemCard.tsx": "Reusable card component for displaying marketplace items with image, pricing, metadata badges, and location. Optionally renders action buttons for contacting the seller or deleting the item.",
  "frontend/src/components/LoginModal.tsx": "Modal dialog prompting users to log in or sign up using Internet Identity. Manages auth intent, loading states, and closes automatically on successful authentication.",
  "frontend/src/components/ProfileSetup.tsx": "Wrapper component that enforces profile creation after authentication, including name, university email validation, and saving the user profile. Handles auth intent flow, logout, and displays a welcome screen when unauthenticated.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor based on the current Internet Identity using React Query. Automatically recreates the actor on identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for managing Internet Identity authentication, including login, logout, persisted identity loading, and detailed login status flags. Wraps Dfinity AuthClient with app-specific configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating marketplace data (user profiles, buy/sell, rentals, lost & found) via a backend actor, with centralized error formatting and retry logic.",
  "frontend/src/index.css": "Sets up Tailwind CSS base, component, and utility layers with a detailed light/dark theme using CSS variables, plus marketplace-specific shadows, transitions, and typography.",
  "frontend/src/main.tsx": "Bootstraps the React app by creating the root and wrapping App with React Query and Internet Identity providers, and importing global styles.",
  "frontend/src/pages/BuySection.tsx": "Implements the Buy marketplace page with item listing, filtering, deletion for owners, network error handling, and retry UI using data from useGetBuySellItems.",
  "frontend/src/pages/Homepage.tsx": "Renders the landing page with a hero section, category navigation, and previews of recent buy and rental items fetched via query hooks.",
  "frontend/src/pages/LostFoundSection.tsx": "Provides the Lost & Found page with tabs for lost/found items, authentication and profile checks, add/delete item modals, and robust loading and network error handling.",
  "frontend/src/pages/RentSection.tsx": "React page that fetches and displays rental listings, handles network/loading states, and conditionally shows owner actions. Supports authenticated item listing and deletion with profile gating, login prompts, and confirmation modals.",
  "frontend/src/pages/SellSection.tsx": "React page for managing the authenticated user’s for-sale listings, including fetching items, adding new listings, and deleting existing ones. Enforces login and completed profile before posting, with network error handling and modals.",
  "frontend/src/utils/authIntent.ts": "Utility for persisting whether a user intended to log in or sign up across Internet Identity redirects using sessionStorage. Provides safe set, get, and clear helpers with graceful error handling.",
  "frontend/src/utils/universityEmail.ts": "Helper functions to validate that an email belongs to the @jainuniversity.ac.in domain and to return user-friendly validation error messages. Used for enforcing university-only registration.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters from query strings or hash routes and persisting them in sessionStorage. Includes helpers to store, retrieve, clear, and sanitize sensitive parameters without page reloads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, container settings, custom color tokens via CSS variables, typography, animations, and plugins. Centralizes design system theming and layout behavior.",
  "project_state.json": "Machine-readable snapshot of the project’s current direction, architecture, and implemented features. Documents Internet Computer stack decisions, authentication, RBAC, profile gating, and core marketplace functionality status."
}