{
  "backend/main.mo": "Defines core marketplace types and state for items, lost & found, user profiles, onboarding, and chat, including helper functions and admin email whitelist.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding nextMessageId and initializing chatState.",
  "feature_evidence.json": "Lists features, related frontend files, components, and test IDs for chat UI, contact actions, contact page update, and visual theme work.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing routing, components, styles, and chat-related hooks.",
  "frontend/index.css": "Empty stylesheet placeholder with no content.",
  "frontend/index.html": "Basic HTML entry point defining metadata and loading the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, including new messages inbox and thread pages, wrapped in layout with profile setup.",
  "frontend/src/components/AddItemModal.tsx": "Modal for creating items with fields, image upload handling, and categorized error reporting on submit.",
  "frontend/src/components/AuthResolutionErrorScreen.tsx": "Displays error screens for timeout, access-denied, or generic errors with icons, messages, and retry/logout actions.",
  "frontend/src/components/DeleteConfirmationModal.tsx": "A confirmation dialog for deleting an item with cancel and delete actions, showing loading state when deleting.",
  "frontend/src/components/FloatingAddButton.tsx": "A fixed circular button that triggers an add action when clicked.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, navigation links, description, and copyright text.",
  "frontend/src/components/Header.tsx": "Top navigation bar with logo, search, authentication handling, mobile menu, and messaging access.",
  "frontend/src/components/ItemCard.tsx": "Displays an item preview with image, details, badges, price, and optional contact/delete actions.",
  "frontend/src/components/LoginModal.tsx": "Modal prompting users to log in or sign up with Internet Identity, showing loading states.",
  "frontend/src/components/ProfileAvatarMenu.tsx": "User avatar dropdown showing profile info and providing a logout option.",
  "frontend/src/components/ProfileSetup.tsx": "Controls onboarding flow by checking profile and onboarding answers, displaying dialogs, and submitting profile data and questions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous actor, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useActorInitGuard.ts": "Initializes the authenticated actor with timeout and error handling, exposing status and retry logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management via a React context.",
  "frontend/src/hooks/useQueries.ts": "Defines profile, onboarding, and other actor-backed queries and mutations with timeout and error sanitization.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom OKLCH color system with light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/About.tsx": "Renders the About page with mission, features, and overview of the UniXange platform.",
  "frontend/src/pages/BuySection.tsx": "Displays marketplace buy listings with filtering, item deletion, and seller contact actions, including login and network error handling.",
  "frontend/src/pages/Contact.tsx": "Provides contact and support options with links to messaging and support emails, prompting login when necessary.",
  "frontend/src/pages/Homepage.tsx": "Renders the homepage with hero content, category shortcuts, and previews of recent buy and rental items.",
  "frontend/src/pages/LostFoundSection.tsx": "Manages lost and found listings with item creation, deletion, profile checks, and messaging the item owner.",
  "frontend/src/pages/MessagesInbox.tsx": "Shows the user's message inbox with navigation back home and a placeholder when no conversations exist.",
  "frontend/src/pages/MessagesThread.tsx": "Displays a conversation thread with message sending, auto-scrolling, and error handling for invalid or failed loads.",
  "frontend/src/pages/Privacy.tsx": "Renders the Privacy Policy page with sections describing data collection, usage, sharing, and user rights.",
  "frontend/src/pages/RentSection.tsx": "Manages rental listings with item fetch, add, delete, and contact-owner actions, handling authentication and profile validation.",
  "frontend/src/pages/SellSection.tsx": "Displays and manages the user's items for sale, including adding and deleting listings with auth and profile checks.",
  "frontend/src/pages/Terms.tsx": "Renders the Terms of Service page outlining eligibility, responsibilities, prohibited activities, and liability limits.",
  "frontend/src/utils/actorInitErrors.ts": "Defines timeout error helpers and type guards for actor initialization handling.",
  "frontend/src/utils/adminEmailAllowlist.ts": "Stores an admin email allowlist and provides helpers to check or retrieve allowed emails.",
  "frontend/src/utils/authIntent.ts": "Provides utilities to persist and retrieve login/signup intent via sessionStorage.",
  "frontend/src/utils/icRejectionErrors.ts": "Detects IC rejection errors, including stopped canister cases, and extracts canister IDs.",
  "frontend/src/utils/promiseTimeout.ts": "Wraps promises with a timeout, producing a standardized timeout error on delay.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Converts raw errors into user-friendly messages, handling IC, timeout, network, and auth issues.",
  "frontend/src/utils/universityEmail.ts": "Validates Jain University emails or allowlisted admin emails and provides an error message helper.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL params, storing them in sessionStorage, and managing persisted parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, plugins, and layout settings for the frontend.",
  "project_state.json": "Describes current project state and feature roadmap focused on building an in-app chat system with polling."
}