{
  "kind": "build_request",
  "title": "Fix profile load failure when backend canister is stopped and remove createActor agentOptions warning",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Detect the specific Internet Computer rejection case where the backend canister is stopped (e.g., reject_message contains \"is stopped\" / error_code \"IC0508\") during authenticated actor initialization (including `_initializeAccessControlWithSecret`) and surface a clear, user-friendly error message in the UI instead of the generic \"Something Went Wrong\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "reject_message\": \"Canister acg2y-eiaaa-aaaab-aan7a-cai is stopped\"",
          "Method name: _initializeAccessControlWithSecret",
          "User message: \"build it\""
        ]
      },
      "acceptanceCriteria": [
        "When the actor init flow fails with an IC rejection indicating the canister is stopped, the rendered error screen message explicitly indicates the backend is currently unavailable because the canister is stopped.",
        "The error screen includes the canister ID from the error payload (e.g., \"acg2y-eiaaa-aaaab-aan7a-cai\") in the displayed message (or a clearly labeled details section).",
        "The existing Retry and Logout actions remain available (Retry uses the existing in-app retry behavior in ProfileSetup)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Update error sanitization / formatting so that stopped-canister errors are categorized and converted into stable English user-facing text (while still logging the raw error to the console for debugging).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "\"status\": \"non_replicated_rejection\"",
          "\"error_code\": \"IC0508\"",
          "\"reject_code\": 5"
        ]
      },
      "acceptanceCriteria": [
        "A stopped-canister error is mapped to a deterministic, readable message (not a raw CBOR/agent payload) suitable for `AuthResolutionErrorScreen`.",
        "Raw error details continue to be logged to the browser console to aid debugging without being shown verbatim in the UI."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Eliminate the runtime warning \"Detected both agent and agentOptions passed to createActor. Ignoring agentOptions and proceeding with the provided agent.\" by ensuring actor creation only passes one of `agent` or `agentOptions` (not both) when calling `createActorWithConfig`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Detected both agent and agentOptions passed to createActor. Ignoring agentOptions and proceeding with the provided agent."
        ]
      },
      "acceptanceCriteria": [
        "The warning about passing both `agent` and `agentOptions` no longer appears in the browser console during login/profile load.",
        "Authenticated and anonymous actor creation continue to work as before (no regressions in profile loading flow aside from improved error handling)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Prevent duplicated access-control initialization calls during app startup by consolidating authenticated actor initialization behind the guarded path (so `_initializeAccessControlWithSecret` is not triggered redundantly by multiple actor hooks).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Method name: _initializeAccessControlWithSecret"
        ]
      },
      "acceptanceCriteria": [
        "On a normal authenticated load, `_initializeAccessControlWithSecret` is invoked at most once per identity/session initialization flow (unless the user explicitly retries).",
        "Retry from the error screen re-runs actor initialization via the existing in-app retry mechanism and does not require a full page reload."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only shadcn components).",
    "Do not edit immutable paths listed by SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx). If changes are needed, implement safe alternatives via new hooks/utilities and update non-immutable call sites accordingly.",
    "Backend must remain a single Motoko actor in backend/main.mo; add migration.mo only if persistent state schema changes (not expected for this fix)."
  ],
  "nonGoals": [
    "Starting/resuming the stopped canister from within the app (this is an operational/deployment action, not an application feature).",
    "Adding new authentication providers beyond Internet Identity.",
    "Implementing real-time features (WebSockets/push)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}