{
  "kind": "build_request",
  "title": "Rebuild footer to match uploaded screenshot layout (beige/black theme)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Rebuild the existing footer component to match the structure and spacing of the uploaded screenshot: three main columns (left: brand name + short description; middle: “Quick Links” list; right: “About” heading + short paragraph), followed by a single bottom copyright line.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make it like this",
          "1 but keep the colour like the app is i mean the beige and black colour",
          "replace with the projects name",
          "2 yess",
          "yess go for it"
        ]
      },
      "acceptanceCriteria": [
        "Footer uses a 3-column layout on desktop and stacks cleanly on mobile (brand/description, quick links, about).",
        "Middle column contains link items: Buy, Sell, Rent, Lost & Found and routes to /buy, /sell, /rent, /lost-found.",
        "Right column shows an About paragraph (not just a single 'About Us' link) using the project name (UniXange) in the text.",
        "Bottom area shows only: “© {currentYear} UniXange. All Rights Reserved.” centered (or visually matching the screenshot), and removes the “Built with … caffeine.ai” line.",
        "Overall colors remain consistent with the app’s beige/black theme (no new color scheme introduced), using existing Tailwind tokens (e.g., bg-background/bg-card, text-foreground, muted-foreground)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the updated footer is integrated in the global layout without changing routing or authentication logic, and that the app builds successfully after the previous failed build attempt.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "❌ Sorry, app creation didn't work out",
          "It looks like the build didn’t go through — want me to try generating it again?",
          "yess go for it"
        ]
      },
      "acceptanceCriteria": [
        "No changes are made to backend canister code.",
        "No changes are made to immutable hook files under frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
        "Footer renders on all pages as before (via App layout), with no runtime errors or broken links.",
        "Project compiles without TypeScript or lint errors related to the footer changes."
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed as immutable in SYSTEM_CONTEXT (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Keep all backend logic in the single Motoko actor; no backend changes are required for this footer-only update."
  ],
  "nonGoals": [
    "Adding new pages or routes beyond using existing routes (/buy, /sell, /rent, /lost-found, /about, etc.).",
    "Introducing new authentication, analytics, or third-party integrations.",
    "Changing the global theme tokens in a way that alters the app’s overall beige/black visual identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}