{
  "kind": "build_request",
  "title": "Add in-app contact chat between customers and listing owners (polling-based)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement backend support for an in-app chat that lets a customer start (or reopen) a conversation with a listing owner and exchange messages using non-real-time polling.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-11",
          "msg-13"
        ],
        "quotes": [
          "i want that when customer click on contact option then they could communicate through chat with the user",
          "built it"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes Candid methods to (1) create or fetch a conversation for a given listing and counterpart, (2) send a message, (3) fetch messages for a conversation with pagination/limits suitable for polling, and (4) list the caller’s conversations.",
        "Conversation access is restricted so only the two participants (and admins, if admin support already exists) can read/send messages.",
        "All chat methods enforce the same campus-membership/authorization expectations used elsewhere in the canister (no anonymous messaging).",
        "Message timestamps/order are stable and deterministic so the frontend can safely poll and append new messages without duplicates.",
        "If adding new stable state is required for chat persistence, provide an upgrade-safe approach (add a conditional `backend/migration.mo` only if the existing canister stores stable state that would break on upgrade)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a messages UI in the frontend: an inbox of conversations and a conversation thread screen that polls for new messages and allows sending messages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-11",
          "msg-13"
        ],
        "quotes": [
          "i want that when customer click on contact option then they could communicate through chat with the user",
          "built it"
        ]
      },
      "acceptanceCriteria": [
        "A new route exists for an inbox screen where authenticated users can see their conversations (with last message preview and timestamp).",
        "A conversation thread screen exists where users can read message history and send a new message; the thread polls for updates using React Query (e.g., `refetchInterval`).",
        "Errors from chat calls are shown as stable English user-facing text (and raw errors are still logged to the console, consistent with existing patterns in `useQueries.ts`).",
        "If the user is not authenticated, attempting to open messages prompts the existing login flow instead of failing silently.",
        "User-facing text in the new UI is in English."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Wire the existing per-item “Contact” action to open the in-app chat with the correct listing owner, creating the conversation if needed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-11"
        ],
        "quotes": [
          "when customer click on contact option then they could communicate through chat with the user"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the “Contact” button rendered by `frontend/src/components/ItemCard.tsx` opens/navigates to a chat thread for that listing and seller/owner.",
        "If a conversation does not yet exist, it is created on-demand and then opened.",
        "The “Contact” button is disabled/hidden for the listing owner when viewing their own listing (to prevent messaging self)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the existing static Contact page to clarify it is for support/feedback, and add a clear entry point to the new in-app messages inbox for contacting sellers/owners.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-11"
        ],
        "quotes": [
          "i think there is a option called contact in the website"
        ]
      },
      "acceptanceCriteria": [
        "`/contact` remains a support/feedback page (no removal of existing support emails).",
        "The Contact page includes an English call-to-action link/button that navigates authenticated users to the messages inbox (and prompts login if not authenticated)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Apply a cohesive visual theme across the new chat screens so they match the marketplace UI, using a distinct style that is consistent throughout the messages experience.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-13"
        ],
        "quotes": [
          "built it"
        ]
      },
      "acceptanceCriteria": [
        "Messages UI uses a consistent theme (e.g., warm neutrals with a single accent color, consistent typography, spacing, and card styles) aligned with the existing Tailwind/Shadcn look-and-feel.",
        "No blue/purple-dominant palette is introduced unless already present in the current design tokens.",
        "The messages UI supports light/dark mode behavior consistent with the existing `ThemeProvider` setup in `frontend/src/App.tsx`."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit files under `frontend/immutablePaths` (e.g., `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`). Compose with existing components instead.",
    "No real-time transports (no WebSockets/Socket.io); implement chat via polling using React Query.",
    "Use English for all new user-facing UI text."
  ],
  "nonGoals": [
    "Implementing real-time typing indicators, presence, or read receipts.",
    "Integrating third-party chat providers or external databases.",
    "Replacing Internet Identity authentication with any third-party auth.",
    "Adding push notifications or email notifications for new messages."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}