{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Footer rebuild to match screenshot layout (beige/black theme)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Rebuild Footer to match screenshot: 3 columns (brand/description, Quick Links, About paragraph) plus a single centered copyright line, keeping beige/black theme tokens.",
      "acceptanceCriteria": [
        "Footer uses a 3-column layout on desktop and stacks cleanly on mobile (brand/description, quick links, about).",
        "Middle column contains link items: Buy, Sell, Rent, Lost & Found and routes to /buy, /sell, /rent, /lost-found.",
        "Right column shows an About paragraph (not just a single 'About Us' link) using the project name (UniXange) in the text.",
        "Bottom area shows only: “© {currentYear} UniXange. All Rights Reserved.” centered (or visually matching the screenshot), and removes the “Built with … caffeine.ai” line.",
        "Overall colors remain consistent with the app’s beige/black theme (no new color scheme introduced), using existing Tailwind tokens (e.g., bg-background/bg-card, text-foreground, muted-foreground)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Replace current 4-section footer with a 3-column layout matching the screenshot: left brand name + short description, middle 'Quick Links' list linking to /buy, /sell, /rent, /lost-found, right 'About' heading + paragraph mentioning UniXange; update spacing/typography to visually match screenshot; remove the Heart icon import and the caffeine.ai credit line; ensure bottom bar contains only the centered “© {currentYear} UniXange. All Rights Reserved.” line and uses existing theme tokens (bg-card/bg-background, text-foreground/muted-foreground) without introducing new colors."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Keep footer integrated in the global layout and ensure build succeeds without changing routing/auth logic or immutable files.",
      "acceptanceCriteria": [
        "No changes are made to backend canister code.",
        "No changes are made to immutable hook files under frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
        "Footer renders on all pages as before (via App layout), with no runtime errors or broken links.",
        "Project compiles without TypeScript or lint errors related to the footer changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify Footer remains rendered in the global Layout on all routes (keep it after <main>), with no changes to routing/auth logic; limit changes to non-functional adjustments only (if any) needed to preserve global integration after Footer refactor."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Double-check Footer changes do not introduce TypeScript errors (e.g., unused imports), and that TanStack Router <Link> usage is correct for /buy, /sell, /rent, /lost-found; ensure no references to immutable hook/UI files are added or modified."
        }
      ]
    }
  ]
}